app/views/events/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
				<td><%= event.location %></td>
				<td><%= event.user.first_name %> <%= event.user.last_name %></td>