app/controllers/events_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."state" = ?  [["state", "CA"]]
SELECT "events".* FROM "events" WHERE (CA)
---
    def index
        user = User.find(current_user.id)
        @local_events = Event.where(state: user.state)
        @other_events = Event.where.not(state: user.state)