app/controllers/sessions_controller.rb

    def create
        if user = User.find_by_email(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "sharon@sharon.com"], ["LIMIT", 1]]