app/controllers/users_controller.rb

    def create
        user = User.create(user_params)
---
INSERT INTO "users" ("email", "location", "state", "created_at", "updated_at", "first_name", "last_name", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?)